<?php

return [
    /*
    |--------------------------------------------------------------------------
    | 小程序 APPID
    |--------------------------------------------------------------------------
    |
    | 这里填写你的小程序的 appid
    | 获取方法请参考 https://mp.weixin.qq.com/
    |
    */
    //'appid' => env('WX_APPID', 'wx47c9ea5812bf9c33'),
    'appid' => env('WX_APPID', 'wx06d5cea896e10366'),

    /*
    |--------------------------------------------------------------------------
    | 小程序 Secret
    |--------------------------------------------------------------------------
    |
    | 这里填写你的小程序的 secret
    | 获取方法请参考https://mp.weixin.qq.com/
    |
    */
   // 'secret' => env('WX_SECRET', '37e3522d408569e9204a0127cbda059f'),
    'secret' => env('WX_SECRET', '7108d0cd353e20426be758ad456c38a8'),
    /*
    |--------------------------------------------------------------------------
    | 小程序的官方接口
    |--------------------------------------------------------------------------
    |
    | 小程序登录时使用凭证 code 获取 session_key 和 openid 地址时使用的接口地址
    | 此处若官方没改变地址则不需要改变地址
    |
    */
    'code2session_url' => "https://api.weixin.qq.com/sns/jscode2session?",
    /*
    |--------------------------------------------------------------------------
    | 网络配置
    |--------------------------------------------------------------------------
    |
    | WxLoginExpires : 微信登录态有效期
    | NetworkTimeout : 网络请求超时时长（单位：毫秒）
    | 若要使用自定义配置，取消下面的备注即可
    |
    */
//    'WxLoginExpires' => 7200,
//    'NetworkTimeout' => 3000,
];